Indemsys/K66BLEZ_WS2812B_LED_strip_control/MKW40Z/OSA/fsl_os_abstraction_free_rtos.c
  /* If pMutex has been locked by current task, return error. */
  if (xSemaphoreGetMutexHolder(*pMutex) == xTaskGetCurrentTaskHandle())
  {
    return kStatus_OSA_Error;
  }

  /* Convert timeout from millisecond to tick. */
  if (timeout == OSA_WAIT_FOREVER)
  {
    timeoutTicks = portMAX_DELAY;
  }
  else
  {
    timeoutTicks = MSEC_TO_TICK(timeout);
  }

  if (xSemaphoreTake(*pMutex, timeoutTicks) == pdFALSE)
  {
    return kStatus_OSA_Timeout; /* timeout */
  }
  else
  {
    return kStatus_OSA_Success; /* semaphore taken */
  }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : OSA_MutexUnlock
 * Description   : This function is used to unlock a mutex.
 *
 *END**************************************************************************/
osa_status_t OSA_MutexUnlock(mutex_t *pMutex)
{
  assert(pMutex);

  /* If pMutex is not locked by current task, return error. */
  if (xSemaphoreGetMutexHolder(*pMutex) != xTaskGetCurrentTaskHandle())
  {
    return kStatus_OSA_Error;
  }

  if (xSemaphoreGive(*pMutex) == pdPASS)
  {
    return kStatus_OSA_Success;
  }
  else
  {
    return kStatus_OSA_Error;
  }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : OSA_MutexDestroy
 * Description   : This function is used to destroy a mutex.
 * Return kStatus_OSA_Success if the lock object is destroyed successfully,
 * otherwise return kStatus_OSA_Error.
 *
 *END**************************************************************************/
osa_status_t OSA_MutexDestroy(mutex_t *pMutex)
{
  assert(pMutex);
  assert(*pMutex);

  vSemaphoreDelete(*pMutex);
  return kStatus_OSA_Success;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : OSA_EventCreate
 * Description   : This function is used to create a event object. Return
 * kStatus_OSA_Success if create successfully, otherwise return kStatus_OSA_Error.
 *
 *END**************************************************************************/
osa_status_t OSA_EventCreate(event_t *pEvent, osa_event_clear_mode_t clearMode)
{
  assert(pEvent);

  pEvent->eventHandler = xEventGroupCreate();

  if (pEvent->eventHandler)
  {
    pEvent->clearMode = clearMode;
    return kStatus_OSA_Success;
  }
  else
  {
    return kStatus_OSA_Error;
  }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : OSA_EventWait
 * Description   : This function checks the event's status, if it meets the wait
 * condition, return kStatus_OSA_Success, otherwise, timeout will be used for
 * wait. The parameter timeout indicates how long should wait in milliseconds.
 * Pass OSA_WAIT_FOREVER to wait indefinitely, pass 0 will return the value
 * kStatus_OSA_Timeout immediately if wait condition is not met. The event flags
 * will be cleared if the event is auto clear mode. Flags that wakeup waiting
 * task could be obtained from the parameter setFlags.
 * This function returns kStatus_OSA_Success if wait condition is met, returns
 * kStatus_OSA_Timeout if wait condition is not met within the specified
 * 'timeout', returns kStatus_OSA_Error if any errors occur during waiting.
 *
 *END**************************************************************************/
osa_status_t OSA_EventWait(event_t       *pEvent,
                           event_flags_t  flagsToWait,
                           bool           waitAll,
                           uint32_t       timeout,
                           event_flags_t *setFlags)
{
  assert(pEvent);
  BaseType_t clearMode;
  uint32_t timeoutTicks;
  event_flags_t flagsSave;

  /* Convert timeout from millisecond to tick. */
  if (timeout == OSA_WAIT_FOREVER)
  {
    timeoutTicks = portMAX_DELAY;
  }
  else
  {
    timeoutTicks = timeout / portTICK_PERIOD_MS;
  }

  clearMode = (kEventAutoClear == pEvent->clearMode) ? pdTRUE : pdFALSE;

  flagsSave = xEventGroupWaitBits(pEvent->eventHandler,
                                  flagsToWait,
                                  clearMode,
                                  (BaseType_t)waitAll,
                                  timeoutTicks);

  *setFlags = flagsSave & flagsToWait;

  if (*setFlags)
  {
    return kStatus_OSA_Success;
  }
  else
  {
    return kStatus_OSA_Timeout;
  }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : OSA_EventSet
 * Description   : Set one or more event flags of an event object.
 * Return kStatus_OSA_Success if set successfully, kStatus_OSA_Error if failed.
 *
 *END**************************************************************************/
osa_status_t OSA_EventSet(event_t *pEvent, event_flags_t flagsToSet)
{
  assert(pEvent);
  portBASE_TYPE taskToWake = pdFALSE;

  if (__get_IPSR())
  {
    xEventGroupSetBitsFromISR(pEvent->eventHandler, flagsToSet, &taskToWake);
    if (pdTRUE == taskToWake)
    {
      vPortYieldFromISR();
    }
  }
  else
  {
    xEventGroupSetBits(pEvent->eventHandler, flagsToSet);
  }
  return kStatus_OSA_Success;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : OSA_EventClear
 * Description   : Clear one or more event flags of an event object.
 * Return kStatus_OSA_Success if clear successfully, kStatus_OSA_Error if failed.
 *
 *END**************************************************************************/
osa_status_t OSA_EventClear(event_t *pEvent, event_flags_t flagsToClear)
{
  assert(pEvent);

  if (__get_IPSR())
  {
    xEventGroupClearBitsFromISR(pEvent->eventHandler, flagsToClear);
  }
  else
  {
    xEventGroupClearBits(pEvent->eventHandler, flagsToClear);
  }

  return kStatus_OSA_Success;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : OSA_EventGetFlags
 * Description   : Get event flags status.
 * Return current event flags.
 *
 *END**************************************************************************/
event_flags_t OSA_EventGetFlags(event_t *pEvent)
{
  assert(pEvent);

