Indemsys/K66BLEZ_WS2812B_LED_strip_control/MKW40Z/OSA/fsl_os_abstraction_free_rtos.c
  if (__get_IPSR())
  {
    return xEventGroupGetBitsFromISR(pEvent->eventHandler);
  }
  else
  {
    return xEventGroupGetBits(pEvent->eventHandler);
  }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : OSA_EventDestroy
 * Description   : This function is used to destroy a event object. Return
 * kStatus_OSA_Success if the event object is destroyed successfully, otherwise
 * return kStatus_OSA_Error.
 *
 *END**************************************************************************/
osa_status_t OSA_EventDestroy(event_t *pEvent)
{
  assert(pEvent);
  vEventGroupDelete(pEvent->eventHandler);
  return kStatus_OSA_Success;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : OSA_TaskCreate
 * Description   : This function is used to create a task and make it ready.
 * Return kStatus_OSA_Success if register successfully, otherwise return
 * kStatus_OSA_Error.
 *
 *END**************************************************************************/
osa_status_t OSA_TaskCreate(task_t          task,
                            uint8_t        *name,
                            uint16_t        stackSize,
                            task_stack_t   *stackMem,
                            uint16_t        priority,
                            task_param_t    param,
                            bool            usesFloat,
                            task_handler_t *handler)
{
  if (xTaskCreate(
                  task,  /* pointer to the task */
                  (char const *)name, /* task name for kernel awareness debugging */
                  stackSize / sizeof(portSTACK_TYPE), /* task stack size */
                  param, /* optional task startup argument */
                  PRIORITY_OSA_TO_RTOS(priority),  /* initial priority */
                  handler /* optional task handle to create */
                 ) != pdPASS)
  {
    return kStatus_OSA_Error; /* error! probably out of memory */
  }
  return kStatus_OSA_Success;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : OSA_TaskDestroy
 * Description   : This function destroy a task. Return kStatus_OSA_Success if
 * the task is destroied, otherwise return kStatus_OSA_Error.
 *
 *END**************************************************************************/
osa_status_t OSA_TaskDestroy(task_handler_t handler)
{
  #if INCLUDE_vTaskDelete /* vTaskDelete() enabled */
  vTaskDelete(handler);
  return kStatus_OSA_Success;
  #else
  return kStatus_OSA_Error; /* vTaskDelete() not available */
  #endif
}

/*FUNCTION**********************************************************************
 *
 * Function Name : OSA_TaskYield
 * Description   : When a task calls this function, it will give up CPU and put
 * itself to the tail of ready list.
 *
 *END**************************************************************************/
osa_status_t OSA_TaskYield(void)
{
  taskYIELD();
  return kStatus_OSA_Success;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : OSA_TaskGetHandler
 * Description   : This function is used to get current active task's handler.
 *
 *END**************************************************************************/
task_handler_t OSA_TaskGetHandler(void)
{
  return xTaskGetCurrentTaskHandle();
}

/*FUNCTION**********************************************************************
 *
 * Function Name : OSA_TaskGetPriority
 * Description   : This function returns task's priority by task handler.
 *
 *END**************************************************************************/
uint16_t OSA_TaskGetPriority(task_handler_t handler)
{
  return (uint16_t)(PRIORITY_RTOS_TO_OSA(uxTaskPriorityGet(handler)));
}

/*FUNCTION**********************************************************************
 *
 * Function Name : OSA_TaskSetPriority
 * Description   : This function sets task's priority by task handler.
 *
 *END**************************************************************************/
osa_status_t OSA_TaskSetPriority(task_handler_t handler, uint16_t priority)
{
  vTaskPrioritySet(handler, PRIORITY_OSA_TO_RTOS(priority));
  return kStatus_OSA_Success;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : OSA_MsgQCreate
 * Description   : This function is used to create a message queue.
 * Return the handle to the message queue if create successfully, otherwise
 * return 0.
 *
 *END**************************************************************************/
msg_queue_handler_t OSA_MsgQCreate(msg_queue_t *queue,
                                   uint16_t  message_number,
                                   uint16_t  message_size)
{
  return xQueueCreate(message_number, message_size * sizeof(uint32_t));
}

static osa_status_t OSA_MessageQueuePutFromTask(msg_queue_handler_t handler, void *pMessage)
{
  if (xQueueSendToBack(handler, pMessage, 0) != pdPASS)
  {
    return kStatus_OSA_Error; /* not able to send it to the queue? */
  }
  else
  {
    return kStatus_OSA_Success;
  }
}

static osa_status_t OSA_MessageQueuePutFromISR(msg_queue_handler_t handler, void *pMessage)
{
  portBASE_TYPE taskToWake = pdFALSE;

  if (pdTRUE == xQueueSendToBackFromISR(handler, pMessage, &taskToWake))
  {
    if (pdTRUE == taskToWake)
    {
      vPortYieldFromISR();
    }
    return kStatus_OSA_Success;
  }
  else
  {
    return kStatus_OSA_Error;
  }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : OSA_MsgQPut
 * Description   : This function is used to put a message to a message queue.
 * Return kStatus_OSA_Success if the message is put successfully, otherwise
 * return kStatus_OSA_Error.
 *
 *END**************************************************************************/
osa_status_t OSA_MsgQPut(msg_queue_handler_t handler, void *pMessage)
{
  if (__get_IPSR())
  {
    return OSA_MessageQueuePutFromISR(handler, pMessage);
  }
  else
  {
    return OSA_MessageQueuePutFromTask(handler, pMessage);
  }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : OSA_MsgQGet
 * Description   : This function checks the queue's status, if it is not empty,
 * get message from it and return kStatus_OSA_Success, otherwise, timeout will
 * be used for wait. The parameter timeout indicates how long should wait in
 * milliseconds. Pass OSA_WAIT_FOREVER to wait indefinitely, pass 0 will return
 * kStatus_OSA_Timeout immediately if queue is empty.
 * This function returns kStatus_OSA_Success if message is got successfully,
 * returns kStatus_OSA_Timeout if message queue is empty within the specified
 * 'timeout', returns kStatus_OSA_Error if any errors occur during waiting.
 *
 *END**************************************************************************/
osa_status_t OSA_MsgQGet(msg_queue_handler_t handler,
                         void               *pMessage,
                         uint32_t            timeout)
{
  uint32_t timeoutTicks;

