Indemsys/K66BLEZ_WS2812B_LED_strip_control/MKW40Z/OSA/fsl_os_abstraction_free_rtos.c
  if (timeout == OSA_WAIT_FOREVER)
  {
    timeoutTicks = portMAX_DELAY;
  }
  else
  {
    timeoutTicks = MSEC_TO_TICK(timeout);
  }
  if (xQueueReceive(handler, pMessage, timeoutTicks) != pdPASS)
  {
    return kStatus_OSA_Timeout; /* not able to send it to the queue? */
  }
  else
  {
    return kStatus_OSA_Success;
  }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : OSA_MsgQDestroy
 * Description   : This function is used to destroy the message queue.
 * Return kStatus_OSA_Success if the message queue is destroyed successfully,
 * otherwise return kStatus_OSA_Error.
 *
 *END**************************************************************************/
osa_status_t OSA_MsgQDestroy(msg_queue_handler_t handler)
{
  vQueueDelete(handler);
  return kStatus_OSA_Success;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : OSA_MemAlloc
 * Description   : This function is used to allocate amount of memory in bytes.
 * Return the pointer to the memory if success, otherwise return NULL;
 *
 *END**************************************************************************/
void* OSA_MemAlloc(size_t size)
{
  return pvPortMalloc(size);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : OSA_MemAllocZero
 * Description   : This function is used to allocate amount of memory in bytes
 * and initializes it to 0.
 * Return the pointer to the memory if success, otherwise return NULL;
 *
 *END**************************************************************************/
void* OSA_MemAllocZero(size_t size)
{
  void *ptr = pvPortMalloc(size);

  if (ptr == NULL)
  {
    return NULL; /* failed allocating memory */
  }
  return memset(ptr, 0, size);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : OSA_MemFree
 * Description   : This function is used to free the memory previously allocated.
 *
 *END**************************************************************************/
osa_status_t OSA_MemFree(void *ptr)
{
  vPortFree(ptr);
  return kStatus_OSA_Success;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : OSA_TimeDelay
 * Description   : This function is used to delay for a number of milliseconds.
 *
 *END**************************************************************************/
void OSA_TimeDelay(uint32_t delay)
{
  vTaskDelay(MSEC_TO_TICK(delay));
}

/*FUNCTION**********************************************************************
 *
 * Function Name : OSA_TimeGetMsec
 * Description   : This function gets current time in milliseconds.
 *
 *END**************************************************************************/
uint32_t OSA_TimeGetMsec(void)
{
  portTickType ticks;

  if (__get_IPSR())
  {
    ticks = xTaskGetTickCountFromISR();
  }
  else
  {
    ticks = xTaskGetTickCount();
  }

  return TICKS_TO_MSEC(ticks);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : OSA_InstallIntHandler
 * Description   : This function is used to install interrupt handler.
 *
 *END**************************************************************************/
osa_int_handler_t OSA_InstallIntHandler(int32_t IRQNumber, osa_int_handler_t handler)
{
  #if defined ( __IAR_SYSTEMS_ICC__ )
  _Pragma("diag_suppress = Pm138")
  #endif
  return (osa_int_handler_t)INT_SYS_InstallHandler((IRQn_Type)IRQNumber, handler);
  #if defined ( __IAR_SYSTEMS_ICC__ )
  _Pragma("diag_remark = PM138")
  #endif
}

/*FUNCTION**********************************************************************
 *
 * Function Name : OSA_EnterCritical
 * Description   : This function is used to ensure some code will not be preempted.
 *
 *END**************************************************************************/
static uint32_t g_base_priority_array[OSA_MAX_ISR_CRITICAL_SECTION_DEPTH];
static int32_t  g_base_priority_top = 0;
void OSA_EnterCritical(osa_critical_section_mode_t mode)
{
  if (kCriticalDisableInt == mode)
  {
    if (__get_IPSR())
    {
      assert(g_base_priority_top < OSA_MAX_ISR_CRITICAL_SECTION_DEPTH);

      g_base_priority_array[g_base_priority_top] = portSET_INTERRUPT_MASK_FROM_ISR();
      g_base_priority_top++;
    }
    else
    {
      portENTER_CRITICAL();
    }
  }
  else
  {
    vTaskSuspendAll();
  }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : OSA_ExitCritical
 * Description   : This function is used to exit critical section.
 *
 *END**************************************************************************/
void OSA_ExitCritical(osa_critical_section_mode_t mode)
{
  if (kCriticalDisableInt == mode)
  {
    if (__get_IPSR())
    {
      g_base_priority_top--;
      assert(g_base_priority_top >= 0);

      portCLEAR_INTERRUPT_MASK_FROM_ISR(g_base_priority_array[g_base_priority_top]);
    }
    else
    {
      portEXIT_CRITICAL();
    }
  }
  else
  {
    xTaskResumeAll();
  }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : OSA_Init
 * Description   : This function is used to setup the basic services, it should
 * be called first in function main. Return kStatus_OSA_Success if services
 * are initialized successfully, otherwise return kStatus_OSA_Error.
 *
 *END**************************************************************************/
osa_status_t OSA_Init(void)
{
  return kStatus_OSA_Success;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : OSA_Start
 * Description   : This function is used to start RTOS scheduler.
 *
 *END**************************************************************************/
osa_status_t OSA_Start(void)
{
  vTaskStartScheduler();
  return kStatus_OSA_Success;
}



#endif /* FSL_RTOS_FREE_RTOS */

/*******************************************************************************
 * EOF
 ******************************************************************************/
